# ReverseIterator Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
ElectricalSystemSet..::..ReverseIterator Method
ElectricalSystemSet Class See Also
---
Retrieve a backward moving iterator to the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
# Syntax
C#
---
```text
public virtual ElectricalSystemSetIterator ReverseIterator()
```

Visual Basic
---
```text
Public Overridable Function ReverseIterator As ElectricalSystemSetIterator
```

Visual C++
---
```text
public:
virtual ElectricalSystemSetIterator^ ReverseIterator()
```

# ### Return Value
Returns a backward moving iterator to the set.
# See Also
ElectricalSystemSet Class
Autodesk.Revit.DB.Electrical Namespace